Revit 2024 API
ViewportRotation Enumeration
 Rotation of the viewport
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum ViewportRotation
Visual Basic
Public Enumeration ViewportRotation
Visual C++
public enum class ViewportRotation
Members
Member name | Description
None |  Viewport is not rotated.
Clockwise |  Viewport is rotated 90 degrees clockwise.
Counterclockwise |  Viewport is rotated 90 degrees counterclockwise.
See Also
Autodesk.Revit.DB Namespace